; ModuleID = 'main.c'
source_filename = "main.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.s2 = type { %struct.s3*, double }
%struct.s3 = type { i8*, i8* }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }
%struct.s1 = type { i32, i32, i8*, %struct.s2 }

@.str = private unnamed_addr constant [5 x i8] c"gude\00", align 1
@.str.1 = private unnamed_addr constant [12 x i8] c"not tainted\00", align 1

; Function Attrs: noinline nounwind optnone uwtable
define %struct.s2* @foo(i32 %n, ...) #0 !dbg !9 {
entry:
  %n.addr = alloca i32, align 4
  %ap = alloca [1 x %struct.__va_list_tag], align 16
  %ut1 = alloca i32, align 4
  %s1 = alloca %struct.s1, align 8
  %s1ptr = alloca %struct.s1*, align 8
  %s2 = alloca %struct.s2, align 8
  %tmp = alloca %struct.s2, align 8
  %s2ptr = alloca %struct.s2*, align 8
  %s3 = alloca %struct.s3, align 8
  %s3ptr = alloca %struct.s3*, align 8
  %ut2 = alloca i8*, align 8
  %t1 = alloca i8*, align 8
  %ut3 = alloca i8*, align 8
  %ut4 = alloca i8*, align 8
  %t2 = alloca i8*, align 8
  %ut5 = alloca i8*, align 8
  %ut6 = alloca i8*, align 8
  %t3 = alloca i8*, align 8
  %ut7 = alloca i8*, align 8
  %t4 = alloca i8*, align 8
  %ut8 = alloca i8*, align 8
  %t5 = alloca i8*, align 8
  %ut9 = alloca i8*, align 8
  %t6 = alloca i8*, align 8
  %ut10 = alloca i8*, align 8
  store i32 %n, i32* %n.addr, align 4

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 5.0.1 (tags/RELEASE_501/final 348479)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3)
!1 = !DIFile(filename: "main.c", directory: "/home/sebastian/.qt-creator-workspace/Phasar/Test/200-map-to-callee-varargs-13")
!2 = !{}
!3 = !{!4}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!5 = !{i32 2, !"Dwarf Version", i32 4}
!6 = !{i32 2, !"Debug Info Version", i32 3}
!7 = !{i32 1, !"wchar_size", i32 4}
!8 = !{!"clang version 5.0.1 (tags/RELEASE_501/final 348479)"}
!9 = distinct !DISubprogram(name: "foo", scope: !1, file: !1, line: 24, type: !10, isLocal: false, isDefinition: true, scopeLine: 25, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!10 = !DISubroutineType(types: !11)
!11 = !{!12, !25, null}
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64)
!13 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "s2", file: !1, line: 11, size: 128, elements: !14)
!14 = !{!15, !23}
!15 = !DIDerivedType(tag: DW_TAG_member, name: "s3", scope: !13, file: !1, line: 12, baseType: !16, size: 64)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64)
!17 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "s3", file: !1, line: 6, size: 128, elements: !18)
!18 = !{!19, !22}
!19 = !DIDerivedType(tag: DW_TAG_member, name: "t1", scope: !17, file: !1, line: 7, baseType: !20, size: 64)
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64)
!21 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "ut1", scope: !17, file: !1, line: 8, baseType: !20, size: 64, offset: 64)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !13, file: !1, line: 13, baseType: !24, size: 64, offset: 64)
!24 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!25 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!26 = !DILocalVariable(name: "n", arg: 1, scope: !9, file: !1, line: 24, type: !25)
!27 = !DIExpression()
!28 = !DILocation(line: 24, column: 9, scope: !9)
!29 = !DILocalVariable(name: "ap", scope: !9, file: !1, line: 26, type: !30)
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !31, line: 30, baseType: !32)
!31 = !DIFile(filename: "/home/sebastian/documents/programming/llvm/jail/llvm501/lib/clang/5.0.1/include/stdarg.h", directory: "/home/sebastian/.qt-creator-workspace/Phasar/Test/200-map-to-callee-varargs-13")
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !1, line: 26, baseType: !33)
!33 = !DICompositeType(tag: DW_TAG_array_type, baseType: !34, size: 192, elements: !41)
!34 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !1, line: 26, size: 192, elements: !35)
!35 = !{!36, !38, !39, !40}
!36 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !34, file: !1, line: 26, baseType: !37, size: 32)
!37 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !34, file: !1, line: 26, baseType: !37, size: 32, offset: 32)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !34, file: !1, line: 26, baseType: !4, size: 64, offset: 64)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !34, file: !1, line: 26, baseType: !4, size: 64, offset: 128)
!41 = !{!42}
!42 = !DISubrange(count: 1)
!43 = !DILocation(line: 26, column: 13, scope: !9)
!44 = !DILocation(line: 27, column: 5, scope: !9)
!45 = !DILocalVariable(name: "ut1", scope: !9, file: !1, line: 29, type: !25)
!46 = !DILocation(line: 29, column: 9, scope: !9)
!47 = !DILocation(line: 29, column: 15, scope: !9)
!48 = !DILocalVariable(name: "s1", scope: !9, file: !1, line: 30, type: !49)
!49 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "s1", file: !1, line: 16, size: 256, elements: !50)
!50 = !{!51, !52, !53, !54}
!51 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !49, file: !1, line: 17, baseType: !25, size: 32)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !49, file: !1, line: 18, baseType: !25, size: 32, offset: 32)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "t1", scope: !49, file: !1, line: 19, baseType: !20, size: 64, offset: 64)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "s2", scope: !49, file: !1, line: 20, baseType: !13, size: 128, offset: 128)
!55 = !DILocation(line: 30, column: 15, scope: !9)
!56 = !DILocation(line: 30, column: 20, scope: !9)
!57 = !DILocalVariable(name: "s1ptr", scope: !9, file: !1, line: 31, type: !58)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64)
!59 = !DILocation(line: 31, column: 16, scope: !9)
!60 = !DILocation(line: 31, column: 24, scope: !9)
!61 = !DILocalVariable(name: "s2", scope: !9, file: !1, line: 32, type: !13)
!62 = !DILocation(line: 32, column: 15, scope: !9)
!63 = !DILocation(line: 32, column: 20, scope: !9)
!64 = !DILocalVariable(name: "s2ptr", scope: !9, file: !1, line: 33, type: !12)
!65 = !DILocation(line: 33, column: 16, scope: !9)
!66 = !DILocation(line: 33, column: 24, scope: !9)
!67 = !DILocalVariable(name: "s3", scope: !9, file: !1, line: 34, type: !17)
!68 = !DILocation(line: 34, column: 15, scope: !9)
!69 = !DILocation(line: 34, column: 20, scope: !9)
!70 = !DILocalVariable(name: "s3ptr", scope: !9, file: !1, line: 35, type: !16)
!71 = !DILocation(line: 35, column: 16, scope: !9)
!72 = !DILocation(line: 35, column: 24, scope: !9)
!73 = !DILocalVariable(name: "ut2", scope: !9, file: !1, line: 36, type: !20)
!74 = !DILocation(line: 36, column: 11, scope: !9)
!75 = !DILocation(line: 36, column: 17, scope: !9)
!76 = !DILocation(line: 38, column: 5, scope: !9)
!77 = !DILocalVariable(name: "t1", scope: !9, file: !1, line: 40, type: !20)
!78 = !DILocation(line: 40, column: 11, scope: !9)
!79 = !DILocation(line: 40, column: 19, scope: !9)
!80 = !DILocation(line: 40, column: 22, scope: !9)
!81 = !DILocation(line: 40, column: 26, scope: !9)
!82 = !DILocalVariable(name: "ut3", scope: !9, file: !1, line: 41, type: !20)
!83 = !DILocation(line: 41, column: 11, scope: !9)
!84 = !DILocation(line: 41, column: 20, scope: !9)
!85 = !DILocalVariable(name: "ut4", scope: !9, file: !1, line: 42, type: !20)
!86 = !DILocation(line: 42, column: 11, scope: !9)
!87 = !DILocation(line: 42, column: 20, scope: !9)
!88 = !DILocation(line: 42, column: 23, scope: !9)
!89 = !DILocation(line: 42, column: 27, scope: !9)
!90 = !DILocalVariable(name: "t2", scope: !9, file: !1, line: 44, type: !20)
!91 = !DILocation(line: 44, column: 11, scope: !9)
!92 = !DILocation(line: 44, column: 16, scope: !9)
!93 = !DILocation(line: 44, column: 23, scope: !9)
!94 = !DILocation(line: 44, column: 26, scope: !9)
!95 = !DILocation(line: 44, column: 30, scope: !9)
!96 = !DILocalVariable(name: "ut5", scope: !9, file: !1, line: 45, type: !20)
!97 = !DILocation(line: 45, column: 11, scope: !9)
!98 = !DILocation(line: 45, column: 17, scope: !9)
!99 = !DILocation(line: 45, column: 24, scope: !9)
!100 = !DILocalVariable(name: "ut6", scope: !9, file: !1, line: 46, type: !20)
!101 = !DILocation(line: 46, column: 11, scope: !9)
!102 = !DILocation(line: 46, column: 17, scope: !9)
!103 = !DILocation(line: 46, column: 24, scope: !9)
!104 = !DILocation(line: 46, column: 27, scope: !9)
!105 = !DILocation(line: 46, column: 31, scope: !9)
!106 = !DILocalVariable(name: "t3", scope: !9, file: !1, line: 48, type: !20)
!107 = !DILocation(line: 48, column: 11, scope: !9)
!108 = !DILocation(line: 48, column: 19, scope: !9)
!109 = !DILocation(line: 48, column: 23, scope: !9)
!110 = !DILocalVariable(name: "ut7", scope: !9, file: !1, line: 49, type: !20)
!111 = !DILocation(line: 49, column: 11, scope: !9)
!112 = !DILocation(line: 49, column: 20, scope: !9)
!113 = !DILocation(line: 49, column: 24, scope: !9)
!114 = !DILocalVariable(name: "t4", scope: !9, file: !1, line: 51, type: !20)
!115 = !DILocation(line: 51, column: 11, scope: !9)
!116 = !DILocation(line: 51, column: 16, scope: !9)
!117 = !DILocation(line: 51, column: 23, scope: !9)
!118 = !DILocation(line: 51, column: 27, scope: !9)
!119 = !DILocalVariable(name: "ut8", scope: !9, file: !1, line: 52, type: !20)
!120 = !DILocation(line: 52, column: 11, scope: !9)
!121 = !DILocation(line: 52, column: 17, scope: !9)
